package com.zhuzichu.android.shared.http.exception

enum class NimError(val code: Int, val message: String) {
    Error201(201, "客户端版本不对，需升级sdk"),
    Error301(301, "被封禁"),
    Error302(302, "用户名或密码错误"),
    Error315(315, "IP限制"),
    Error403(403, "非法操作或没有权限"),
    Error404(404, "对象不存在"),
    Error405(405, "参数长度过长"),
    Error406(406, "对象只读"),
    Error408(408, "客户端请求超时"),
    Error413(413, "验证失败(短信服务)"),
    Error414(414, "参数错误"),
    Error415(415, "客户端网络问题"),
    Error416(416, "频率控制"),
    Error417(417, "重复操作"),
    Error418(418, "通道不可用(短信服务)"),
    Error419(419, "数量超过上限"),
    Error422(422, "账号被禁用"),
    Error431(431, "HTTP重复请求"),
    Error500(500, "服务器内部错误"),
    Error503(503, "服务器繁忙"),
    Error508(508, "消息撤回时间超限"),
    Error509(509, "无效协议"),
    Error514(514, "服务不可用"),
    Error998(998, "解包错误"),
    Error999(999, "打包错误"),
    Error801(801, "群人数达到上限"),
    Error802(802, "没有权限"),
    Error803(803, "群不存在"),
    Error804(804, "用户不在群"),
    Error805(805, "群类型不匹配"),
    Error806(806, "创建群数量达到限制"),
    Error807(807, "群成员状态错误"),
    Error808(808, "申请成功"),
    Error809(809, "已经在群内"),
    Error810(810, "邀请成功"),
    Error9102(9102, "通道失效"),
    Error9103(9103, "已经在他端对这个呼叫响应过了"),
    Error11001(11001, "通话不可达，对方处于离线状态"),
    Error13001(13001, "IM主连接状态异常"),
    Error13002(13002, "聊天室状态异常"),
    Error13003(13003, "账号在黑名单中,不允许进入聊天室"),
    Error13004(13004, "在禁言列表中,不允许发言"),
    Error13005(13005, "用户的聊天室昵称、头像或成员扩展字段被反垃圾"),
    Error10431(10431, "输入email不是邮箱"),
    Error10432(10432, "输入mobile不是手机号码"),
    Error10433(10433, "注册输入的两次密码不相同"),
    Error10434(10434, "企业不存在"),
    Error10435(10435, "登陆密码或账号不对"),
    Error10436(10436, "app不存在"),
    Error10437(10437, "email已注册"),
    Error10438(10438, "手机号已注册"),
    Error1000(10438, "本地操作异常"), ;

    companion object{
        fun toMessage(code: Int): String {
            values().forEach {
                if (code == it.code) {
                    return it.message
                }
            }
            return "未知错误"
        }
    }

}